-- Вставка пользователей
INSERT INTO users (username, email, password_hash, role, register_date) VALUES
('user1', 'user1@example.com', 'hashed_password1', 'reader', NOW()),
('user2', 'user2@example.com', 'hashed_password2', 'admin', NOW());

-- Вставка авторов
INSERT INTO authors (name, bio) VALUES
('Александр Пушкин', ''),
('Лев Толстой', ''),
('Фёдор Достоевский', ''),
('Антон Чехов', ''),
('Иван Тургенев', ''),
('Максим Горький', ''),
('Сергей Есенин', ''),
('Марина Цветаева', ''),
('Владимир Набоков', ''),
('Андрей Белый', ''),
('Иосиф Бродский', ''),
('Светлана Алексиевич', ''),
('Даниил Гранин', ''),
('Габриэль Гарсиа Маркес', ''),
('Харуки Мураками', ''),
('Джордж Оруэлл', ''),
('Фрэнсис Скотт Фицджеральд', ''),
('Курт Воннегут', ''),
('Джейн Остин', ''),
('Эмили Бронте', ''),
('Дмитрий Глуховский', ''),
('Татьяна Толстая', ''),
('Алексей Иванов', ''),
('Людмила Улицкая', ''),
('Сергей Лукьяненко', ''),
('Григорий Остер', ''),
('Мария Метлицкая', ''),
('Виктор Пелевин', ''),
('Анна Невская', ''),
('Ирина Хакамада', '');


-- Вставка категорий
INSERT INTO categories (category_name) VALUES
('Фантастика'),
('Романтика'),
('Детектив'),
('Приключения'),
('Научная литература'),
('Историческая проза'),
('Фэнтези'),
('Ужасы'),
('Поэзия'),
('Драма'),
('Комедия'),
('Биография'),
('Автобиография'),
('Эссеистика'),
('Классическая литература');

-- Вставка книг
INSERT INTO books (title, published_year, isbn, description, added_at, file_path, cover_image_path) VALUES
('Война и мир', 1869, '978-3-16-148410-0', 'Эпопея.', CURRENT_TIMESTAMP, 'storage/books/book1.fb2', 'storage/covers/cover1.jpg'),
('1984', 1949, '978-0-452-28423-4', 'Антиутопия.', CURRENT_TIMESTAMP, 'storage/books/book2.fb2', 'storage/covers/cover2.jpg'),
('Убить пересмешника', 1960, '978-0-06-112008-4', 'Роман о расизме.', CURRENT_TIMESTAMP, 'storage/books/book3.fb2', 'storage/covers/cover3.jpg'),
('Гордость и предубеждение', 1813, '978-0-19-953556-9', 'Роман о любви.', CURRENT_TIMESTAMP, 'storage/books/book4.fb2', 'storage/covers/cover4.jpg'),
('Мастер и Маргарита', 1967, '978-5-17-034123-4', 'Роман о любви.', CURRENT_TIMESTAMP, 'storage/books/book5.fb2', 'storage/covers/cover5.jpg'),
('Три товарища', 1936, '978-3-16-148410-1', 'Роман о дружбе.', CURRENT_TIMESTAMP, 'storage/books/book6.fb2', 'storage/covers/cover6.jpg'),
('451 градус по Фаренгейту', 1953, '978-0-7432-7356-0', 'Антиутопия.', CURRENT_TIMESTAMP, 'storage/books/book7.fb2', 'storage/covers/cover7.jpg'),
('Преступление и наказание', 1866, '978-0-14-305814-4', 'Роман о морали.', CURRENT_TIMESTAMP, 'storage/books/book8.fb2', 'storage/covers/cover8.jpg'),
('Братья Карамазовы', 1880, '978-0-14-044924-2', 'Философский роман.', CURRENT_TIMESTAMP, 'storage/books/book9.fb2', 'storage/covers/cover9.jpg'),
('Собачье сердце', 1925, '978-5-17-034124-1', 'Сатирическая повесть.', CURRENT_TIMESTAMP, 'storage/books/book10.fb2', 'storage/covers/cover10.jpg'),
('Маленький принц', 1943, '978-3-16-148410-2', 'Сказка о любви.', CURRENT_TIMESTAMP, 'storage/books/book11.fb2', 'storage/covers/cover11.jpg'),
('Сияние', 1977, '978-0-385-12167-5', 'Ужасный роман.', CURRENT_TIMESTAMP, 'storage/books/book12.fb2', 'storage/covers/cover12.jpg'),
('Девушка с татуировкой дракона', 2005, '978-0-307-26545-2', 'Триллер.', CURRENT_TIMESTAMP, 'storage/books/book13.fb2', 'storage/covers/cover13.jpg'),
('Тень горы', 2006, '978-0-7432-7357-7', 'Роман о жизни.', CURRENT_TIMESTAMP, 'storage/books/book14.fb2', 'storage/covers/cover14.jpg'),
('Старик и море', 1952, '978-0-684-80122-3', 'Повесть о борьбе.', CURRENT_TIMESTAMP, 'storage/books/book15.fb2', 'storage/covers/cover15.jpg'),
('На дороге', 1957, '978-0-14-028329-7', 'Роман о свободе.', CURRENT_TIMESTAMP, 'storage/books/book16.fb2', 'storage/covers/cover16.jpg'),
('Сияние солнца', 2001, '978-0-06-112008-5', 'Роман о жизни.', CURRENT_TIMESTAMP, 'storage/books/book17.fb2', 'storage/covers/cover17.jpg'),
('Тайна третьей планеты', 1981, '978-5-17-034125-8', 'Научная фантастика.', CURRENT_TIMESTAMP, 'storage/books/book18.fb2', 'storage/covers/cover18.jpg'),
('Золотой ключик', 1936, '978-5-17-034126-5', 'Сказка для детей.', CURRENT_TIMESTAMP, 'storage/books/book19.fb2', 'storage/covers/cover19.jpg'),
('Сказка о царе Салтане', 1831, '978-5-17-034127-2', 'Сказка о любви.', CURRENT_TIMESTAMP, 'storage/books/book20.fb2', 'storage/covers/cover20.jpg'),
('Слепая улица', 2010, '978-5-17-034133-3', 'Роман о поисках себя.', CURRENT_TIMESTAMP, 'storage/books/book34.fb2', 'storage/covers/cover34.jpg'),
('Тайна старого замка', 2008, '978-5-17-034134-0', 'Приключенческий роман.', CURRENT_TIMESTAMP, 'storage/books/book35.fb2', 'storage/covers/cover35.jpg'),
('Загадка древнего храма', 2015, '978-5-17-034135-7', 'Роман о приключениях.', CURRENT_TIMESTAMP, 'storage/books/book36.fb2', 'storage/covers/cover36.jpg'),
('Путешествие к центру Земли', 1864, '978-5-17-034136-4', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book37.fb2', 'storage/covers/cover37.jpg'),
('Скрижали Судьбы', 2012, '978-5-17-034137-1', 'Фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book38.fb2', 'storage/covers/cover38.jpg'),
('Легенда о Наране', 2018, '978-5-17-034138-8', 'Фэнтези о приключениях.', CURRENT_TIMESTAMP, 'storage/books/book39.fb2', 'storage/covers/cover39.jpg'),
('Тайна исчезнувшего города', 2011, '978-5-17-034139-5', 'Приключенческий роман.', CURRENT_TIMESTAMP, 'storage/books/book40.fb2', 'storage/covers/cover40.jpg'),
('Свет в окне', 2009, '978-5-17-034140-1', 'Роман о любви.', CURRENT_TIMESTAMP, 'storage/books/book41.fb2', 'storage/covers/cover41.jpg'),
('Звезды на земле', 2014, '978-5-17-034141-8', 'Роман о мечтах.', CURRENT_TIMESTAMP, 'storage/books/book42.fb2', 'storage/covers/cover42.jpg'),
('Сквозь время', 2016, '978-5-17-034142-5', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book43.fb2', 'storage/covers/cover43.jpg'),
('В поисках утраченного времени', 1913, '978-5-17-034143-2', 'Философский роман.', CURRENT_TIMESTAMP, 'storage/books/book44.fb2', 'storage/covers/cover44.jpg'),
('Светлячок', 2013, '978-5-17-034144-9', 'Роман о дружбе.', CURRENT_TIMESTAMP, 'storage/books/book45.fb2', 'storage/covers/cover45.jpg'),
('Забытая сказка', 2017, '978-5-17-034145-6', 'Сказка о любви.', CURRENT_TIMESTAMP, 'storage/books/book46.fb2', 'storage/covers/cover46.jpg'),
('Тайна старого маяка', 2019, '978-5-17-034146-3', 'Приключенческий роман.', CURRENT_TIMESTAMP, 'storage/books/book47.fb2', 'storage/covers/cover47.jpg'),
('Сквозь тернии к звездам', 2020, '978-5-17-034147-0', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book48.fb2', 'storage/covers/cover48.jpg'),
('Заброшенный остров', 2021, '978-5-17-034148-7', 'Приключенческий роман.', CURRENT_TIMESTAMP, 'storage/books/book49.fb2', 'storage/covers/cover49.jpg'),
('Секреты древних цивилизаций', 2022, '978-5-17-034149-4', 'Научно-популярный роман.', CURRENT_TIMESTAMP, 'storage/books/book50.fb2', 'storage/covers/cover50.jpg'),
('Забытая мелодия', 2023, '978-5-17-034151-7', 'Роман о музыке.', CURRENT_TIMESTAMP, 'storage/books/book52.fb2', 'storage/covers/cover52.jpg'),
('Тайна заброшенного дома', 2024, '978-5-17-034150-0', 'Приключенческий роман о загадках.', CURRENT_TIMESTAMP, 'storage/books/book51.fb2', 'storage/covers/cover51.jpg'),
('Свет в конце тоннеля', 2025, '978-5-17-034152-4', 'Роман о надежде и любви.', CURRENT_TIMESTAMP, 'storage/books/book53.fb2', 'storage/covers/cover53.jpg'),
('Забытая история', 2026, '978-5-17-034153-1', 'Исторический роман о прошлом.', CURRENT_TIMESTAMP, 'storage/books/book54.fb2', 'storage/covers/cover54.jpg'),
('Путешествие в неизведанное', 2027, '978-5-17-034154-8', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book55.fb2', 'storage/covers/cover55.jpg'),
('Секреты старого замка', 2028, '978-5-17-034155-5', 'Приключенческий роман о тайнах.', CURRENT_TIMESTAMP, 'storage/books/book56.fb2', 'storage/covers/cover56.jpg'),
('Звезды в наших сердцах', 2029, '978-5-17-034156-2', 'Роман о любви и мечтах.', CURRENT_TIMESTAMP, 'storage/books/book57.fb2', 'storage/covers/cover57.jpg'),
('В поисках счастья', 2030, '978-5-17-034157-9', 'Роман о поисках смысла жизни.', CURRENT_TIMESTAMP, 'storage/books/book58.fb2', 'storage/covers/cover58.jpg'),
('Тайна древнего артефакта', 2031, '978-5-17-034158-6', 'Приключенческий роман о древностях.', CURRENT_TIMESTAMP, 'storage/books/book59.fb2', 'storage/covers/cover59.jpg'),
('Сквозь время и пространство', 2032, '978-5-17-034159-3', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book60.fb2', 'storage/covers/cover60.jpg'),
('Светлая сторона жизни', 2033, '978-5-17-034160-9', 'Роман о позитивном мышлении.', CURRENT_TIMESTAMP, 'storage/books/book61.fb2', 'storage/covers/cover61.jpg'),
('Загадка исчезнувшего мира', 2034, '978-5-17-034161-6', 'Фантастический роман о приключениях.', CURRENT_TIMESTAMP, 'storage/books/book62.fb2', 'storage/covers/cover62.jpg'),
('Скрижали древних знаний', 2035, '978-5-17-034162-3', 'Научно-популярный роман.', CURRENT_TIMESTAMP, 'storage/books/book63.fb2', 'storage/covers/cover63.jpg'),
('Ветер перемен', 2036, '978-5-17-034163-0', 'Роман о переменах в жизни.', CURRENT_TIMESTAMP, 'storage/books/book64.fb2', 'storage/covers/cover64.jpg'),
('Тайна заброшенного острова', 2037, '978-5-17-034164-7', 'Приключенческий роман о поисках.', CURRENT_TIMESTAMP, 'storage/books/book65.fb2', 'storage/covers/cover65.jpg'),
('Сквозь тернии к звездам', 2038, '978-5-17-034165-4', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book66.fb2', 'storage/covers/cover66.jpg'),
('Забытая мелодия', 2039, '978-5-17-034166-1', 'Роман о музыке и любви.', CURRENT_TIMESTAMP, 'storage/books/book67.fb2', 'storage/covers/cover67.jpg'),
('Секреты древних цивилизаций', 2040, '978-5-17-034167-8', 'Научно-популярный роман.', CURRENT_TIMESTAMP, 'storage/books/book68.fb2', 'storage/covers/cover68.jpg'),
('Загадка старого маяка', 2041, '978-5-17-034168-5', 'Приключенческий роман о тайнах.', CURRENT_TIMESTAMP, 'storage/books/book69.fb2', 'storage/covers/cover69.jpg'),
('Тайна исчезнувшего города', 2042, '978-5-17-034169-2', 'Приключенческий роман о поисках.', CURRENT_TIMESTAMP, 'storage/books/book70.fb2', 'storage/covers/cover70.jpg'),
('Сквозь время', 2043, '978-5-17-034170-8', 'Научно-фантастический роман.', CURRENT_TIMESTAMP, 'storage/books/book71.fb2', 'storage/covers/cover71.jpg'),
('Заброшенный замок', 2044, '978-5-17-034171-5', 'Приключенческий роман о загадках.', CURRENT_TIMESTAMP, 'storage/books/book72.fb2', 'storage/covers/cover72.jpg'),
('Свет в темноте', 2045, '978-5-17-034172-2', 'Роман о надежде и любви.', CURRENT_TIMESTAMP, 'storage/books/book73.fb2', 'storage/covers/cover73.jpg');


INSERT INTO book_authors (author_id, book_id) VALUES
(1, 1),  -- Александр Пушкин с книгой 1
(1, 2),  -- Александр Пушкин с книгой 2
(2, 3),  -- Лев Толстой с книгой 3
(2, 4),  -- Лев Толстой с книгой 4
(3, 5),  -- Фёдор Достоевский с книгой 5
(3, 6),  -- Фёдор Достоевский с книгой 6
(4, 7),  -- Антон Чехов с книгой 7
(4, 8),  -- Антон Чехов с книгой 8
(5, 9),  -- Иван Тургенев с книгой 9
(5, 10), -- Иван Тургенев с книгой 10
(6, 11), -- Максим Горький с книгой 11
(6, 12), -- Максим Горький с книгой 12
(7, 13), -- Сергей Есенин с книгой 13
(8, 14), -- Марина Цветаева с книгой 14
(9, 15), -- Владимир Набоков с книгой 15
(10, 16), -- Андрей Белый с книгой 16
(11, 17), -- Иосиф Бродский с книгой 17
(12, 18), -- Светлана Алексиевич с книгой 18
(13, 19), -- Даниил Гранин с книгой 19
(14, 20), -- Габриэль Гарсиа Маркес с книгой 20
(15, 21), -- Харуки Мураками с книгой 21
(16, 22), -- Джордж Оруэлл с книгой 22
(17, 23), -- Фрэнсис Скотт Фицджеральд с книгой 23
(18, 24), -- Курт Воннегут с книгой 24
(19, 25), -- Джейн Остин с книгой 25
(20, 26), -- Эмили Бронте с книгой 26
(1, 27),  -- Александр Пушкин с книгой 27
(2, 28),  -- Лев Толстой с книгой 28
(3, 29),  -- Фёдор Достоевский с книгой 29
(4, 30),  -- Антон Чехов с книгой 30
(5, 31),  -- Иван Тургенев с книгой 31
(6, 32),  -- Максим Горький с книгой 32
(7, 33),  -- Сергей Есенин с книгой 33
(8, 34),  -- Марина Цветаева с книгой 34
(9, 35),  -- Владимир Набоков с книгой 35
(10, 36), -- Андрей Белый с книгой 36
(11, 37), -- Иосиф Бродский с книгой 37
(12, 38), -- Светлана Алексиевич с книгой 38
(1, 3),   -- Александр Пушкин с книгой 3
(2, 5),   -- Лев Толстой с книгой 5
(3, 7),   -- Фёдор Достоевский с книгой 7
(4, 9),   -- Антон Чехов с книгой 9
(5, 11),  -- Иван Тургенев с книгой 11
(6, 13),  -- Максим Горький с книгой 13
(7, 15),  -- Сергей Есенин с книгой 15
(8, 17),  -- Марина Цветаева с книгой 17
(9, 19),  -- Владимир Набоков с книгой 19
(10, 21), -- Андрей Белый с книгой 21
(21, 1),  -- Дмитрий Глуховский с книгой 1
(21, 2),  -- Дмитрий Глуховский с книгой 2
(22, 3),  -- Татьяна Толстая с книгой 3
(22, 4),  -- Татьяна Толстая с книгой 4
(23, 5),  -- Алексей Иванов с книгой 5
(23, 6),  -- Алексей Иванов с книгой 6
(24, 7),  -- Людмила Улицкая с книгой 7
(24, 8),  -- Людмила Улицкая с книгой 8
(25, 9),  -- Сергей Лукьяненко с книгой 9
(25, 10), -- Сергей Лукьяненко с книгой 10
(26, 11), -- Григорий Остер с книгой 11
(26, 12), -- Григорий Остер с книгой 12
(27, 13), -- Мария Метлицкая с книгой 13
(28, 14), -- Виктор Пелевин с книгой 14
(28, 15), -- Виктор Пелевин с книгой 15
(29, 16), -- Анна Невская с книгой 16
(30, 17), -- Ирина Хакамада с книгой 17
(30, 18), -- Ирина Хакамада с книгой 18
(21, 19), -- Дмитрий Глуховский с книгой 19
(22, 20), -- Татьяна Толстая с книгой 20
(23, 21), -- Алексей Иванов с книгой 21
(24, 22), -- Людмила Улицкая с книгой 22
(25, 23), -- Сергей Лукьяненко с книгой 23
(26, 24), -- Григорий Остер с книгой 24
(27, 25), -- Мария Метлицкая с книгой 25
(28, 26), -- Виктор Пелевин с книгой 26
(29, 27), -- Анна Невская с книгой 27
(30, 28), -- Ирина Хакамада с книгой 28
(21, 29), -- Дмитрий Глуховский с книгой 29
(22, 30), -- Татьяна Толстая с книгой 30
(23, 31), -- Алексей Иванов с книгой 31
(24, 32), -- Людмила Улицкая с книгой 32
(25, 33), -- Сергей Лукьяненко с книгой 33
(26, 34), -- Григорий Остер с книгой 34
(27, 35), -- Мария Метлицкая с книгой 35
(28, 36), -- Виктор Пелевин с книгой 36
(29, 37), -- Анна Невская с книгой 37
(30, 38), -- Ирина Хакамада с книгой 38
(21, 39), -- Дмитрий Глуховский с книгой 39
(22, 40), -- Татьяна Толстая с книгой 40
(23, 41), -- Алексей Иванов с книгой 41
(24, 42), -- Людмила Улицкая с книгой 42
(25, 43), -- Сергей Лукьяненко с книгой 43
(26, 44), -- Григорий Остер с книгой 44
(27, 45), -- Мария Метлицкая с книгой 45
(28, 46), -- Виктор Пелевин с книгой 46
(29, 47), -- Анна Невская с книгой 47
(30, 48), -- Ирина Хакамада с книгой 48
(21, 49); -- Дмитрий Глуховский с книгой 49

-- Вставка жанров книг
-- Вставка связей между книгами и жанрами
INSERT INTO book_categories (book_id, category_id) VALUES
(1, 1),
(1, 2),
(1, 3),
(2, 2),
(2, 4),
(3, 1),
(3, 5),
(4, 6),
(4, 7),
(5, 1),
(5, 8),
(6, 2),
(6, 9),
(7, 10),
(8, 11),
(9, 12),
(10, 13),
(11, 14),
(12, 15),
(13, 1),
(14, 2),
(15, 3),
(16, 4),
(17, 5),
(18, 6),
(19, 7),
(20, 8),
(21, 9),
(22, 10),
(23, 11),
(24, 12),
(25, 13),
(26, 14),
(27, 15),
(28, 1),
(29, 2),
(30, 3),
(31, 4),
(32, 5),
(33, 6),
(34, 7),
(35, 8),
(36, 9),
(37, 10),
(38, 11),
(39, 12),
(40, 13),
(41, 14),
(42, 15),
(43, 1),
(44, 2),
(45, 3),
(46, 4),
(47, 5),
(48, 6),
(49, 7),
(50, 8),
(51, 9),
(52, 10),
(53, 11),
(54, 12),
(55, 13),
(56, 14),
(57, 15),
(58, 1),
(59, 2),
(60, 3);

-- Вставка информации о загрузках
INSERT INTO downloads (user_id, book_id, download_date) VALUES
(1, 1, NOW()),  -- Пользователь 1 скачал Книгу 1
(2, 2, NOW());  -- Пользователь 2 скачал Книгу 2

-- Вставка оценок
INSERT INTO ratings (user_id, book_id, rating, rated_at) VALUES
(1, 1, 5, DEFAULT),  -- Пользователь 1 оценил книгу 1 на 5
(2, 1, 4, DEFAULT),  -- Пользователь 2 оценил книгу 1 на 4
(1, 2, 3, DEFAULT);  -- Пользователь 1 оценил книгу 2 на 3


-- Вставка комментариев
INSERT INTO comments (user_id, book_id, comment, commented_at) VALUES
(1, 1, 'Отличная книга! Рекомендую всем.', DEFAULT),  -- Пользователь 1 оставил комментарий к книге 1
(2, 1, 'Хорошая, но немного затянутая.', DEFAULT),   -- Пользователь 2 оставил комментарий к книге 1
(1, 2, 'Не понравилась, слишком скучная.', DEFAULT);  -- Пользователь 1 оставил комментарий к книге 2
